/****************************************************************************************
Author: yxs
Date: 2018-09-03
Description:常用接口使用
*****************************************************************************************/
#pragma once
#include <string>
using std::string;



/*************************************************
Description: UTF-8转换到GB3212
Input:
utf8：转换前的utf8字符串
Output:
Return :   转换后的GB2312字符串
Others :
*************************************************/
string U2G(const char* utf8);


/*************************************************
Description: GB2312到UTF-8的转换
Input:
gb2312：转换前的GB2312字符串
Output:
Return :   转换后的utf8字符串
Others :
*************************************************/
string G2U(const char* gb2312);

/*************************************************
Description: 获取当前模块的目录
Input:
Output:
Return :   返回当前模块的目录字符串
Others :
*************************************************/
string GetModuleFilePath();

